// Activity 섹션의 데이터를 객체 형태로 관리합니다.
export const activityData = {
  title: '주요 활동',
  icon: '/assets/image/activity-icon.png',
  items: [
    {
      period: '2023.09 ~ 2023.12',
      title: '서버 프로그래밍 프로젝트 진행 (안양대학교)',
      topic:
        '국내 10개 이상의 주요 뉴스를 읽어와서 NoSQL DB로 저장하고 키워드, 날짜 별 기사 내용을 보여주는 앱',
      role: 'UI/UX 설계 및 프론트엔드 개발, 시각화, 크롤링 보조',
    },
    {
      period: '2024.01.02 ~ 2024.01.04',
      title: '2023 AI 기반 신산업 융합인재 양성 지식재산(IP) 창업 캠프',
      details: 'AI 기술의 사업화 전략 및 지식재산권(IP) 확보의 중요성에 대한 강의 수료',
    },
    {
      period: '2024.10 ~ ',
      title: '소프트웨어학과 3-4학년 과대표',
      role: '학과 공지사항 전달 및 학생 질의응답 대응',
      details: '학생과 교수진 사이의 원활한 소통을 위한 창구 역할 수행',
    },
    {
      period: '2025.01.08 ~ 2025.01.13',
      title: '2024 신산업 융합인재양성사업 명전대-안양대 연합 해외 IP-PBL 워크샵 및 기업탐방',
      role: '학과 대표 (인원 통솔 및 교수님 소통 담당)',
      details: '대만 명전대학교 학생들과 아이디어 토론 및 최종 결과 발표',
    },
    {
      period: '2025.03 ~',
      title: '캡스톤 디자인 졸업작품 진행 중 (안양대학교)',
      topic: 'AI 기반 가상피팅 및 커뮤니티 서비스',
      role: '팀장 / UI/UX 설계 및 프론트엔드 개발 / 크롤링',
    },
    {
      period: '2025.07.08 ~',
      title: 'K-디지털 챌린지 : Net 챌린지 캠프 시즌 12 참가 중 (주최 : 과학기술정보통신부)',
      topic: '범죄 취약 계층의 초동 대응을 위한 스마트 장치 및 AI 기반 실시간 대응 서비스',
      role: 'UI/UX 설계 및 프론트엔드 개발',
    },
  ],
}
